/*
 * Задание 1.6
 * Напиши программу, которая выводит на экран квадрат переменной number;
 */

public class TaskOneCaseSix {
    public static void main(String[] args) {
        int number = 4;
        int square = number * number;
        System.out.println("Задание 1.6: Квадрат переменной number(" + number + ") = " + square);
    }
}
