/*
 * Задание 1.5
 * Напиши программу, которая в методе main объявляет такие переменные:
 * name типа String, age типа int и city типа String.
 */

public class TaskOneCaseFive {
    public static void main(String[] args) {
        String name = "Вася";
        int age = 18;
        String city = "Москва";
        System.out.println("Задание 1.5: В методе объявлены пеоеменные присвоением значений: name(" + name + "), age(" + age + "), city(" + city + ").");
    }
}
